TexasInstruments/c2000ware-core-sdk/driverlib/f28p551x/driverlib/inc/hw_sysctl.h
#define SYSCTL_O_SYNCSELECT        0x0U   // Sync Input and Output Select Register
#define SYSCTL_O_ADCSOCOUTSELECT   0x2U   // External ADCSOC Select Register
#define SYSCTL_O_SYNCSOCLOCK       0x4U   // SYNCSEL and EXTADCSOC Select Lock register

#define SYSCTL_O_LFUCONFIG    0x0U    // LFU configuration Register
#define SYSCTL_O_LFUSTATUS    0x2U    // LFU Configuration Status Register
#define SYSCTL_O_LFU_LOCK     0x1CU   // LFU Lock Configuration
#define SYSCTL_O_LFU_COMMIT   0x1EU   // LFU Commit Configuration

#define SYSCTL_O_SYS_ERR_INT_FLG   0x10U   // Status of interrupts due to multiple different errors
                                           // in the system.
#define SYSCTL_O_SYS_ERR_INT_CLR   0x12U   // SYS_ERR_INT_FLG clear register
#define SYSCTL_O_SYS_ERR_INT_SET   0x14U   // SYS_ERR_INT_FLG set register
#define SYSCTL_O_SYS_ERR_MASK      0x16U   // SYS_ERR_MASK register


//*************************************************************************************************
//
// The following are defines for the bit fields in the PARTIDL register
//
//*************************************************************************************************
#define SYSCTL_PARTIDL_QUAL_S         6U
#define SYSCTL_PARTIDL_QUAL_M         0xC0U       // Qualification Status
#define SYSCTL_PARTIDL_PIN_COUNT_S    8U
#define SYSCTL_PARTIDL_PIN_COUNT_M    0x700U      // Device Pin Count
#define SYSCTL_PARTIDL_INSTASPIN_S    13U
#define SYSCTL_PARTIDL_INSTASPIN_M    0x6000U     // Instaspin feature set
#define SYSCTL_PARTIDL_FLASH_SIZE_S   16U
#define SYSCTL_PARTIDL_FLASH_SIZE_M   0xFF0000U   // FLASH_SIZE

//*************************************************************************************************
//
// The following are defines for the bit fields in the PARTIDH register
//
//*************************************************************************************************
#define SYSCTL_PARTIDH_FAMILY_S            8U
#define SYSCTL_PARTIDH_FAMILY_M            0xFF00U       // Device family
#define SYSCTL_PARTIDH_PARTNO_S            16U
#define SYSCTL_PARTIDH_PARTNO_M            0xFF0000U     // Device part number
#define SYSCTL_PARTIDH_DEVICE_CLASS_ID_S   24U
#define SYSCTL_PARTIDH_DEVICE_CLASS_ID_M   0xFF000000U   // Device class ID

//*************************************************************************************************
//
// The following are defines for the bit fields in the REVID register
//
//*************************************************************************************************
#define SYSCTL_REVID_REVID_S       0U
#define SYSCTL_REVID_REVID_M       0xFFU     // Device Revision ID. This is specific to the Device
#define SYSCTL_REVID_REVID_EXT_S   8U
#define SYSCTL_REVID_REVID_EXT_M   0xFF00U   // Device Revision ID Extension

//*************************************************************************************************
//
// The following are defines for the bit fields in the TRIMERRSTS register
//
//*************************************************************************************************
#define SYSCTL_TRIMERRSTS_LERR_S   0U
#define SYSCTL_TRIMERRSTS_LERR_M   0xFFFFU   // TRIM Load error status

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES0 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES0_CPU1_CLA1   0x1U         // CPU1_CLA1 software reset bit
#define SYSCTL_SOFTPRES0_CPU1_ERAD   0x1000000U   // ERAD Module reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES2 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES2_EPWM1    0x1U     // EPWM1 software reset bit
#define SYSCTL_SOFTPRES2_EPWM2    0x2U     // EPWM2 software reset bit
#define SYSCTL_SOFTPRES2_EPWM3    0x4U     // EPWM3 software reset bit
#define SYSCTL_SOFTPRES2_EPWM4    0x8U     // EPWM4 software reset bit
#define SYSCTL_SOFTPRES2_EPWM5    0x10U    // EPWM5 software reset bit
#define SYSCTL_SOFTPRES2_EPWM6    0x20U    // EPWM6 software reset bit
#define SYSCTL_SOFTPRES2_EPWM7    0x40U    // EPWM7 software reset bit
#define SYSCTL_SOFTPRES2_EPWM8    0x80U    // EPWM8 software reset bit
#define SYSCTL_SOFTPRES2_EPWM9    0x100U   // EPWM9 software reset bit
#define SYSCTL_SOFTPRES2_EPWM10   0x200U   // EPWM10 software reset bit
#define SYSCTL_SOFTPRES2_EPWM11   0x400U   // EPWM11 software reset bit
#define SYSCTL_SOFTPRES2_EPWM12   0x800U   // EPWM12 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES3 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES3_ECAP1   0x1U   // ECAP1 software reset bit
#define SYSCTL_SOFTPRES3_ECAP2   0x2U   // ECAP2 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES4 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES4_EQEP1   0x1U   // EQEP1 software reset bit
#define SYSCTL_SOFTPRES4_EQEP2   0x2U   // EQEP2 software reset bit
#define SYSCTL_SOFTPRES4_EQEP3   0x4U   // EQEP3 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES6 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES6_SD1   0x1U   // SD1 software reset bit
#define SYSCTL_SOFTPRES6_SD2   0x2U   // SD2 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES7 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES7_SCI_A   0x1U   // SCI_A software reset bit
#define SYSCTL_SOFTPRES7_SCI_B   0x2U   // SCI_B software reset bit
#define SYSCTL_SOFTPRES7_SCI_C   0x4U   // SCI_C software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES8 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES8_SPI_A   0x1U   // SPI_A software reset bit
#define SYSCTL_SOFTPRES8_SPI_B   0x2U   // SPI_B software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES9 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES9_I2C_A   0x1U   // I2C_A software reset bit
#define SYSCTL_SOFTPRES9_I2C_B   0x2U   // I2C_B software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES10 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES10_MCAN_A   0x10U   // MCAN_A  software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES13 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES13_ADC_A   0x1U    // ADC_A software reset bit
#define SYSCTL_SOFTPRES13_ADC_B   0x2U    // ADC_B software reset bit
#define SYSCTL_SOFTPRES13_ADC_C   0x4U    // ADC_C software reset bit
#define SYSCTL_SOFTPRES13_ADC_D   0x8U    // ADC_D software reset bit
#define SYSCTL_SOFTPRES13_ADC_E   0x10U   // ADC_E software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES14 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES14_CMPSS1   0x1U   // CMPSS1 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS2   0x2U   // CMPSS2 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS3   0x4U   // CMPSS3 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS4   0x8U   // CMPSS4 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES15 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES15_PGA1   0x1U   // PGA1 software reset bit
#define SYSCTL_SOFTPRES15_PGA2   0x2U   // PGA2 software reset bit
#define SYSCTL_SOFTPRES15_PGA3   0x4U   // PGA3 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES16 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES16_DAC_A   0x10000U   // Buffered_DAC_A software reset bit
#define SYSCTL_SOFTPRES16_DAC_B   0x20000U   // Buffered_DAC_B software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES17 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES17_CLB1   0x1U   // CLB1 software reset bit
#define SYSCTL_SOFTPRES17_CLB2   0x2U   // CLB2 software reset bit
#define SYSCTL_SOFTPRES17_CLB3   0x4U   // CLB3 software reset bit
#define SYSCTL_SOFTPRES17_CLB4   0x8U   // CLB4 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES18 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES18_FSITX_A   0x1U   // FSITX_A software reset bit
#define SYSCTL_SOFTPRES18_FSIRX_A   0x2U   // FSIRX_A software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES19 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES19_LIN_A   0x1U   // LIN_A software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES20 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES20_PMBUS_A   0x1U   // PMBUS_A software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES21 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES21_DCC0   0x1U   // DCC Module reset bit
#define SYSCTL_SOFTPRES21_DCC1   0x2U   // DCC Module reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES26 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES26_AESA   0x1U   // AES Module Reset Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES27 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES27_EPG1   0x1U   // EPG Module Reset Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES28 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES28_FLASHA   0x1U   // Flash Wrapper Module Reset Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES40 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES40_JTAG_NTRST_S       0U
#define SYSCTL_SOFTPRES40_JTAG_NTRST_M       0xFU          // Multi Bit JTAG nTRST
#define SYSCTL_SOFTPRES40_JTAG_NTRST_KEY_S   16U
#define SYSCTL_SOFTPRES40_JTAG_NTRST_KEY_M   0xFFFF0000U   // JTAG nTRST Key

//*************************************************************************************************
//
// The following are defines for the bit fields in the TAP_STATUS register
//
//*************************************************************************************************
#define SYSCTL_TAP_STATUS_TAP_STATE_S   0U
#define SYSCTL_TAP_STATUS_TAP_STATE_M   0xFFFFU       // Present TAP State
#define SYSCTL_TAP_STATUS_DCON          0x80000000U   // Debugger Connect Indication

//*************************************************************************************************
//
// The following are defines for the bit fields in the TAP_CONTROL register
//
//*************************************************************************************************
#define SYSCTL_TAP_CONTROL_BSCAN_DIS   0x1U          // Disable BSCAN TAP control
#define SYSCTL_TAP_CONTROL_KEY_S       16U
#define SYSCTL_TAP_CONTROL_KEY_M       0xFFFF0000U   // Key value to enable write

//*************************************************************************************************
//
// The following are defines for the bit fields in the ECAPTYPE register
//
//*************************************************************************************************
#define SYSCTL_ECAPTYPE_TYPE_S   0U
#define SYSCTL_ECAPTYPE_TYPE_M   0x3U      // Configure ECAP type
#define SYSCTL_ECAPTYPE_LOCK     0x8000U   // Lock bit for the register

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDFMTYPE register
//
//*************************************************************************************************
#define SYSCTL_SDFMTYPE_TYPE_S   0U
#define SYSCTL_SDFMTYPE_TYPE_M   0x3U      // Configure SDFM type
#define SYSCTL_SDFMTYPE_LOCK     0x8000U   // Lock bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF3 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF3_EPWM1    0x1U     // EPWM1 Present
#define SYSCTL_MCUCNF3_EPWM2    0x2U     // EPWM2 Present
#define SYSCTL_MCUCNF3_EPWM3    0x4U     // EPWM3 Present
#define SYSCTL_MCUCNF3_EPWM4    0x8U     // EPWM4 Present
#define SYSCTL_MCUCNF3_EPWM5    0x10U    // EPWM5 Present
#define SYSCTL_MCUCNF3_EPWM6    0x20U    // EPWM6 Present
#define SYSCTL_MCUCNF3_EPWM7    0x40U    // EPWM7 Present
#define SYSCTL_MCUCNF3_EPWM8    0x80U    // EPWM8 Present
#define SYSCTL_MCUCNF3_EPWM9    0x100U   // EPWM9  Present
#define SYSCTL_MCUCNF3_EPWM10   0x200U   // EPWM10  Present
#define SYSCTL_MCUCNF3_EPWM11   0x400U   // EPWM11  Present
#define SYSCTL_MCUCNF3_EPWM12   0x800U   // EPWM12  Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF7 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF7_SD1   0x1U   // SD1  Present
#define SYSCTL_MCUCNF7_SD2   0x2U   // SD2  Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF8 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF8_SCI_A   0x1U   // SCI_A  Present
#define SYSCTL_MCUCNF8_SCI_B   0x2U   // SCI_B  Present
#define SYSCTL_MCUCNF8_SCI_C   0x4U   // SCI_C  Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF11 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF11_MCAN_A   0x10U   // MCAN_A  Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF14 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF14_ADC_A   0x1U    // ADC_A Present
#define SYSCTL_MCUCNF14_ADC_B   0x2U    // ADC_B Present
#define SYSCTL_MCUCNF14_ADC_C   0x4U    // ADC_C Present
#define SYSCTL_MCUCNF14_ADC_D   0x8U    // ADC_D Present
#define SYSCTL_MCUCNF14_ADC_E   0x10U   // ADC_E Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF16 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF16_PGA1   0x1U   // PGA1  Present
#define SYSCTL_MCUCNF16_PGA2   0x2U   // PGA2 Present
#define SYSCTL_MCUCNF16_PGA3   0x4U   // PGA3 Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF18 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF18_LS0_1   0x1U     // LS0_1 Present
#define SYSCTL_MCUCNF18_LS1_1   0x2U     // LS1_1  Present
#define SYSCTL_MCUCNF18_LS2_1   0x4U     // LS2_1  Present
#define SYSCTL_MCUCNF18_LS3_1   0x8U     // LS3_1  Present
#define SYSCTL_MCUCNF18_LS4_1   0x10U    // LS4_1  Present
#define SYSCTL_MCUCNF18_LS5_1   0x20U    // LS5_1  Present
#define SYSCTL_MCUCNF18_LS6_1   0x40U    // LS6_1 Present
#define SYSCTL_MCUCNF18_LS7_1   0x80U    // LS7_1 Present
#define SYSCTL_MCUCNF18_LS8_1   0x100U   // LS8_1 Present
#define SYSCTL_MCUCNF18_LS9_1   0x200U   // LS9_1 Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF20 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF20_GS0   0x1U   // GS0  Present
#define SYSCTL_MCUCNF20_GS1   0x2U   // GS1  Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF21 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF21_CLB1   0x1U   // CLB1 Present
#define SYSCTL_MCUCNF21_CLB2   0x2U   // CLB2 Present
#define SYSCTL_MCUCNF21_CLB3   0x4U   // CLB3 Present
#define SYSCTL_MCUCNF21_CLB4   0x8U   // CLB4 Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF23 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF23_LIN_A   0x1U   // LIN_A  Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF31 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF31_SECT15_0      0x1U    // Flash sectors 15_0 present
#define SYSCTL_MCUCNF31_SECT31_16     0x2U    // Flash sectors 31_16 present
#define SYSCTL_MCUCNF31_SECT47_32     0x4U    // Flash sectors 47_32 present
#define SYSCTL_MCUCNF31_SECT63_48     0x8U    // Flash sectors 63_48 present
#define SYSCTL_MCUCNF31_SECT79_64     0x10U   // Flash sectors 79_64 present
#define SYSCTL_MCUCNF31_SECT95_80     0x20U   // Flash sectors 95_80 present
#define SYSCTL_MCUCNF31_SECT111_96    0x40U   // Flash sectors 111_96 present
#define SYSCTL_MCUCNF31_SECT127_112   0x80U   // Flash sectors 127_112 present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF33 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF33_SECT15_0      0x1U    // Flash sectors 15_0 present
#define SYSCTL_MCUCNF33_SECT31_16     0x2U    // Flash sectors 31_16 present
#define SYSCTL_MCUCNF33_SECT47_32     0x4U    // Flash sectors 47_32 present
#define SYSCTL_MCUCNF33_SECT63_48     0x8U    // Flash sectors 63_48 present
#define SYSCTL_MCUCNF33_SECT79_64     0x10U   // Flash sectors 79_64 present
#define SYSCTL_MCUCNF33_SECT95_80     0x20U   // Flash sectors 95_80 present
#define SYSCTL_MCUCNF33_SECT111_96    0x40U   // Flash sectors 111_96 present
#define SYSCTL_MCUCNF33_SECT127_112   0x80U   // Flash sectors 127_112 present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF35 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF35_SECT15_0    0x1U   // Flash sectors 15_0 present
#define SYSCTL_MCUCNF35_SECT31_16   0x2U   // Flash sectors 31_16 present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNFLOCK register
//
//*************************************************************************************************
#define SYSCTL_MCUCNFLOCK_MCUCNFLOCK   0x1U   // Lock bit for MCUCNF registers


